'number' + 3 + 3 // 'number33' -> конкатинація (рядка і числа) string

null + 3 // 3 -> перетворення null в число при додаванні (0) +3 = 3 (number)

5 && "qwerty" // "qwerty" -> 5 (5>0 true), "qwerty" також true (не пустий рядок), оскільки обидва тру повертаємо останнє значення тру ("qwerty") string

+'40' + +'2' + "hillel"; // "42hillel" -> унарний плюс біля рядків 40 і 2 перетворив їх в числа. 40+2 =42 і далі конкатенація з рядком в "42hillel" string

'10' - 5 === 6; // false -> Операція віднімання, необхідно перетворити рядок в число (10). Далі 10-5=5. Далі строге порівняння по значенню і типу. 5 не дорівнює 6 отже - false (boolean)

true + false // 1 -> В математичній операції приводимо тру і фолс до чисел. True -1, false -0. 1+0=1 (Number)

'4px' - 3 // NaN -> При операції віднімання переводимо обов'язково стрінгу в число (Tonumber). Оскільки ми не можемо перевести 4px в валідне число це NaN. NaN - 3 = NaN (number, спеціальне)

'4' - 3 // 1 -> Операція віднімання приводить операнду до числа (стрінг '4' в число 4), 4-3=1 (Number)

'6' + 3 ** 0; // '61'-> Спочатку операція піднесення до степеня. 3 в степені 0 це одиниця. Далі у нас сума, тому це конкатинація '6'+ 1 ='61' (String)

12 / '6' // 2 -> Операція ділення. Обов'язково переводимо стрінгу '6' в число 6. 12/6=2 (Number)

'10' + (5 === 6); // '10false' -> Спочатку рахуємо в дужках (строга рівність, 5 не дорівнює 6 = false). Далі додаєм рядок до логічного значення, false перетворюється на 'false' тому що є рядок тому в рядок, конкатенуємо '10' + 'false' = '10false' (String)

null == '' // false -> null може дорівнювати лише null aбо undefined. Це не строге порівняння. Null не дорівнює пустому рядку отже - false (boolean)

3 ** (9 / 3); // 27 -> Спочатку те, що в дужкаї. 9 поділити на 3=3. 3 в степені 3 = 27 (Number)

!!'false' == !!'true' // true -> 'false' та 'true' обидва не пусті рядки отже вони truthy. Далі перетворюємо в булеан. Перший знак оклику тру-фолс і там і там. Другий знак оклику фолс-тру і там і там. Не строге порівняння true з true = true (Boolean)

0 || '0' && 1 // 1 -> Оператор && пріорітетніший, тому перетворюємо не пустий рядок в truthy значення. Беремо останнє тру - 1. Оператор || повертає перше тру. О це false тому беремо наступне тру, тобто 1 (Number)

(+null == false) < 1; // false -> Унарний + перетворює null в 0. Нестроге порівняння, перетворюємо false в 0. Нуль дорівнює нулю отже true. Порівнюємо true з числом 1, перетворюємо true в число =1. 1 не менше 1 тож відповідь false (Boolean)

false && true || true // true -> Беремо пріорітетніший &&, тягнемо перший фолс, потім логічне OR false || true де беремо перше тру = true (Boolean)

false && (false || true); // false -> Спочатку в дужках беремо перше тру, потім беремо перше фолс = False (Boolean)

(+null == false) < 1 ** 5; // false -> Спочатку в ступінь. 1 в 5 ступені = 1. Потім в дужках, унарний + перетворює null на 0. Далі не строге порівняння 0==false. False перетворюємо в 0ю 0=0 - true. True<1 (Де true перетворюємо в 1). 1 не менше 1 тож результат false (Boolean)